<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>INSTALACION DE UNA MAQUINA VIRTUAL (VIRTUALBOX)</title>
<style type="text/css">
<!--
.Estilo1 {
	color: #FF0000;
	font-weight: bold;
	font-size: 36px;
}
.Estilo2 {color: #000000; font-weight: bold; font-size: 14px; }
.Estilo3 {font-size: 36px}
.Estilo4 {
	color: #FF0000;
	font-weight: bold;
}
-->
</style>
</head>

<body>
<form id="form1" name="form1" method="post" action="">
  <p align="center" class="Estilo1">INSTALACION  DE UNA MAQUINA VIRTUAL (VIRTUALBOX)</p>
  <p align="left" class="Estilo2">&nbsp; </p>
  <p>VirtualBox es un software de  virtualizaci&oacute;n para arquitecturas x86/amd64. Por medio de esta aplicaci&oacute;n es  posible instalar sistemas operativos adicionales, conocidos como &ldquo;sistemas  invitados&rdquo;, dentro de otro sistema operativo &ldquo;anfitri&oacute;n&rdquo;, cada uno con su  propio ambiente virtual. <br />
    VirtualBox  ofrece algunas buenas funcionalidades, como la ejecuci&oacute;n de m&aacute;quinas virtuales  de forma remota, por medio del&nbsp;<a href="https://es.wikipedia.org/wiki/Remote_Desktop_Protocol">Remote Desktop Protocol</a>&nbsp;(RDP), soporte&nbsp;<a href="https://es.wikipedia.org/wiki/ISCSI">iSCSI</a>, aunque estas opciones no est&aacute;n disponibles en su  versi&oacute;n gratuita.<br />
    Resulta<strong>&nbsp;</strong><strong>una aplicaci&oacute;n extremadamente  &uacute;til</strong>&nbsp;si estamos casi siempre trasteando con sistemas  operativos nuevos o versiones Betas inestables. Un tema que tenemos que tener  presente y que mucha gente me lo comenta es que la experiencia de uso del  sistema no ser&aacute; igual a la de tener un sistema operativo instalado limpiamente  en el ordenador. <br />
    Pasos para la instalaci&oacute;n de VirtualBox:</p>
  <p align="left"><br /></p>
  <p>1.-Se muestra una pantalla donde se da la bienvenida al asistente para  crear la m&aacute;quina virtual. Dar clic en next (siguiente).</p>
  <p align="left"><img src="img/1.png" width="511" height="400" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">2.-Nos muestra la configuraci&oacute;n personalizada haga clic en los iconos en  el &aacute;rbol de abajo para cambiar la forma en que se instalar&aacute;n las funciones.  Clic en next. </p>
  <p align="left"><img src="img/2.png" width="508" height="403" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">3.- Seleccione  la forma en que desea que se instalen las caracter&iacute;sticas. Clic next.</p>
  <p align="left"><img src="img/3.png" width="512" height="399" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">4.-Muestra una advertencia de interfaces de red. Clic en Yes. </p>
  <p align="left"><img src="img/4.png" width="510" height="399" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">5.- El asistente de configuraci&oacute;n est&aacute; listo para comenzar la instalaci&oacute;n  personalizada. Clic en Install.</p>
  <p align="left"><img src="img/5.png" width="510" height="405" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">6.-Muestra una leyenda donde pregunta si desea instalar dar clic en  instalar.</p>
  <p align="left"><img src="img/6.png" width="544" height="405" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">7.- Nos muestra la instalaci&oacute;n completa clic en finish.</p>
  <p align="left"><img src="img/7.png" width="511" height="403" /></p>
  <p align="left">&nbsp;</p>
  <p align="center" class="Estilo4">CREACI&Oacute;N DE  UNA MAQUINA VIRTUAL.</p>
  <p align="left">1.- Muestra una pantalla de bienvenida e iconos para crear la m&aacute;quina  virtual. Clic en Nueva.</p>
  <p align="left"><img src="img/8.png" width="699" height="405" /></p>
  <p align="left">&nbsp;</p>
  <p align="left">2.- Dar nombre a la m&aacute;quina, escoger tipo y versi&oacute;n del software dar  clic en next<br />
. <img src="img/9.png" width="701" height="421" /></p>
  <p align="left"><br />
  3.- Seleccionar el tama&ntilde;o de la memoria. Clic en next.</p>
  <p align="left"><img src="img/10.png" width="700" height="424" /></p>
  <p align="left"><br />
    4.- Seleccionar lo que se desea hacer en el disco duro. Clic en crear.</p>
  <p align="left"><img src="img/11.png" width="699" height="424" /></p>
  <p align="left"><br />
    5.- Seleccionar tipo de archivo de disco duro. Clic en next.</p>
  <p align="left"><img src="img/12.png" width="697" height="452" /></p>
  <p align="left"><br />
    6.-  Seleccionar el almacenamiento en unidad de disco duro f&iacute;sica. Clic en next.</p>
  <p align="left"><img src="img/13.png" width="700" height="449" /></p>
  <p align="left"><br />
    7.-Verificar los datos de ubicaci&oacute;n y clic en crear.</p>
  <p align="left"><img src="img/14.png" width="701" height="449" /></p>
  <p align="left"><br />
    8.- Seleccionar unidad de arranque clic en iniciar esperar a que  cargue. </p>
  <p> <img src="img/15.png" width="436" height="321" /> . . . </p>
  <p>&nbsp;</p>
  <p align="center" class="Estilo3"><a href="video5.HTML" target="_self">VIDEO</a></p>
  <p align="center" class="Estilo3">&nbsp;</p>
</form>
</body>
</html>
