<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>ACCESO AL BIOS PARA CONFIGURAR DISPOSITIVOS Y  SECUENCIAS DE ARRANQUE</title>
<style type="text/css">
<!--
.Estilo2 {
	font-size: 36px;
	color: #00FF00;
}
.Estilo3 {color: #FF0000}
.Estilo4 {
	font-size: 16px;
	color: #333333;
	font-family: Arial, Helvetica, sans-serif;
}
.Estilo5 {font-family: Arial, Helvetica, sans-serif}
.Estilo6 {color: #333333; font-size: 16px;}
.Estilo7 {
	font-size: 16px;
	color: #0000FF;
	font-family: Arial, Helvetica, sans-serif;
	font-weight: bold;
}
.Estilo8 {
	color: #0000FF;
	font-weight: bold;
}
.Estilo9 {
	color: #333333;
	font-size: 36px;
}
-->
</style>
</head>

<body>
<form id="form1" name="form1" method="post" action="">
  <div align="center" class="Estilo2">
    <p class="Estilo3">ACCESO AL BIOS PARA CONFIGURAR DISPOSITIVOS Y  SECUENCIAS DE ARRANQUE  </p>
    <p class="Estilo3">&nbsp;</p>
    <p align="left" class="Estilo4">El&nbsp;BIOS&nbsp;(sigla  en ingl&eacute;s de&nbsp;basic input/output  system; en espa&ntilde;ol &quot;sistema b&aacute;sico de entrada y salida&quot;) es  un&nbsp;software&nbsp;que localiza y  reconoce todos los dispositivos necesarios para cargar el&nbsp;sistema operativo&nbsp;en la&nbsp;memoria RAM; es un software muy  b&aacute;sico instalado en la&nbsp;placa base que permite que &eacute;sta  cumpla su cometido.<br />
      El BIOS se encarga de encontrar el sistema operativo y  cargarlo en la&nbsp;memoria RAM. Posee un componente de hardware y otro de software;  este &uacute;ltimo brinda una interfaz generalmente de texto que permite configurar  varias opciones del hardware instalado en el PC, como por ejemplo el reloj, o  desde qu&eacute; dispositivos de almacenamiento iniciar&aacute; el sistema operativo (Microsoft Windows,&nbsp;GNU/Linux,&nbsp;Mac OS X,  etc.).<br />
      El BIOS antiguamente resid&iacute;a en memorias&nbsp;ROM&nbsp;o&nbsp;EPROM&nbsp;pero desde mediados de los 90 comenz&oacute; a  utilizarse&nbsp;memorias flash&nbsp;que pod&iacute;an ser actualizadas por el usuario. Es un  programa tipo&nbsp;firmware. El BIOS es una parte esencial del hardware que es  totalmente configurable y es donde se controlan los procesos del flujo de  informaci&oacute;n en el bus del ordenador, entre el sistema operativo y los dem&aacute;s  perif&eacute;ricos. Tambi&eacute;n incluye la configuraci&oacute;n de aspectos importantes de la  m&aacute;quina.<br />
      Lo primero  que hace la BIOS es un chequeo de todos los componentes de hardware. Si  encuentra alg&uacute;n fallo, avisa mediante un mensaje en la pantalla o mediante  pitidos de alarma. Las placas base m&aacute;s modernas incorporan indicadores  luminosos que permiten diagnosticar cu&aacute;ndo se produce el error. Este chequeo o  test se llama&nbsp;<strong>POST&nbsp;</strong>(power on  self test, autocomprobaci&oacute;n al conectar).<br />
      - Si el  proceso POST no encuentra problemas, el proceso de arranque contin&uacute;a. En este  momento la BIOS que arranca el ordenador busca la BIOS del adaptador de v&iacute;deo y  la inicia. La informaci&oacute;n sobre la tarjeta de v&iacute;deo se muestra en la pantalla  del monitor (apenas da tiempo a verla).<br />
  <br />
      - Despu&eacute;s de esto, viene la informaci&oacute;n de la propia BIOS, que se refiere al  fabricante y a la versi&oacute;n.<br />
  <br />
      - La BIOS inicia una serie de pruebas del sistema incluida la cantidad de RAM  detectada en el sistema. Los mensajes de error que surjan ahora se presentar&aacute;n  en la pantalla.<br />
  <br />
      - A continuaci&oacute;n, la BIOS comprueba los dispositivos que est&aacute;n presentes con  sus caracter&iacute;sticas; por ejemplo, unidades de disco, CD-ROM.<br />
  <br />
      - Si la BIOS soporta la tecnolog&iacute;a Plug-and-Play, todos los dispositivos  detectados se configuran.<br />
  <br />
      - Al final de la secuencia, la BIOS presenta una pantalla de resumen de datos.</p>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p align="center" class="Estilo4"><br />
      <span class="Estilo8">SECUENCIAS DE ARRANQUE</span></p>
    <p align="left" class="Estilo4"><br />
      La&nbsp;<strong>secuencia de arranque</strong>&nbsp;a menudo es llamada como boot orden, que es  el orden de los dispositivos vinculados con la&nbsp;<strong>BIOS&nbsp;</strong>que el ordenador necesitar&aacute; utilizar para extraer  la informaci&oacute;n del&nbsp;<strong>sistema operativo</strong>.<br />
      A pesar de que la mayor parte de los usuarios  acostumbra a arrancar el ordenador a partir del&nbsp;disco duro,  existe la posibilidad de iniciar el proceso de arranque desde otras unidades,  como las&nbsp;<strong>unidades &oacute;pticas,&nbsp;disqueteras</strong>, unidades flash y otros dispositivos enumerados  dentro de la secuencia de arranque en la BIOS.<br />
      La secuencia de inicio tambi&eacute;n se conoce como orden  de arranque del BIOS o secuencia de inicio del BIOS.<br />
      La secuencia de arranque es la que nos permite  iniciar el ordenador a partir de la unidad seleccionada. Si bien el sistema  operativo puede estar instalado dentro del disco duro, y para iniciar dentro de  &eacute;l se debe hacer desde el mismo disco, tambi&eacute;n es posible iniciar sesi&oacute;n desde  otra unidad como una unidad flash USB o DVD, incluso a trav&eacute;s de sistemas  operativos port&aacute;tiles, es por ello la importancia de la secuencia de arranque y  la posibilidad de cambiar el orden de inicio.<br />
      <strong>Procedimiento para entrar a la  BIOS de un equipo de c&oacute;mputo:</strong><br />
      Se consideran para iniciar la bios las teclas, F1, F2,  Esc, DEL, F10, F3, CTRL+ALT+ESC, CTRL+ALT+INS, CTRL+ALT+S, F2 al arrancar,  Fn+F1 mientras arranca y/o &nbsp;la tecla que  aparezca indicada en la pantalla para entrar al setup de la BIOS. </p>
    <p align="left" class="Estilo4">Ya que se encuentre en el &nbsp;setup desplazarse con la flecha &nbsp;de direcci&oacute;n hacia abajo hasta&nbsp;Boot Sequence y presionar&nbsp;Enter&nbsp;</p>
    <p align="left" class="Estilo4">Ya dentro de la configuraci&oacute;n posicionarse  sobre&nbsp;Internal HDD&nbsp;y  presionar la barra de espacio para deshabilitar al disco duro como primer  dispositivo desde donde booteara el PC. En este caso autom&aacute;ticamente CD/DVD&nbsp;pasar&aacute; a ser el primer  dispositivo desde donde se iniciar&aacute; el PC. Una vez seleccionada la secuencia de  donde se arrancara el ordenador presionar&nbsp;Enter</p>
    <p align="left" class="Estilo4">Luego de lo anterior al cambiar la pantalla  presionar&nbsp;ESC&nbsp;para  salir del setup</p>
    <p align="left" class="Estilo4">Finalmente desplazarse con la flecha de direcci&oacute;n  hacia&nbsp;Save/Exit&nbsp;y  presionar&nbsp;Enter&nbsp;para  guardar los cambios efectuados. El sistema se reiniciar&aacute;.</p>
    <p align="left" class="Estilo4"><br />
    </p>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p align="center" class="Estilo7">MEJORES FABRICANTES DEL BIOS</p>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p align="left" class="Estilo4">Principales fabricantes de la BIOS:</p>
    <div align="left" class="Estilo5">
      <ul class="Estilo6">
        <li>AMI (American Megatrends International) BIOS<br />
          <br />
          AMI BIOS usa bips del mismo largo y tono.<br />
          <br />
          C&oacute;digo bip significado causa probable:<br />
          <br />
          1= Bip Falla en refresco de memoria Memoria  &quot;mala&quot; (o fallada)<br />
          2=Bips Error en paridad de memoria &quot;Memoria  &quot;mala&quot; (o fallada) &quot;<br />
          3= Bips Falla en la memoria base (64k)  &quot;Memoria &quot;mala&quot; (o fallada)&quot;<br />
          4= Bips Reloj no operativo Falla en el  motherboard<br />
          5= Bips Error del procesador Falla en el  Procesador<br />
          6= Bips Falla 8042 Puerta A20 Falla en CPU o  Motherboard<br />
          7= Bips Excepci&oacute;n del procesador Falla en el  procesador<br />
          8= Bips Error en memoria de video Falla en placa  de video o memoria<br />
          9= Bips Error de verificaci&oacute;n (checksum) en ROM  BIOS Fallado<br />
          10= Bips Error de verificaci&oacute;n (checksum) en  CMOS Falla en Motherboard<br />
          11= Bips Mala memoria cache Falla en CPU o  motherboard<br />
        </li>
        <li>AWARD BIOS <br />
          <br />
          Award BIOS utiliza bips de duraci&oacute;n variable. Un  bip largo por lo general dura 2 segundos cuando uno corto solo dura 1 segundo.  Award BIOS tambi&eacute;n usa bips de diferentes frecuencias para indicar errores  cr&iacute;ticos. Si un BIOS Award detecta que el CPU se est&aacute; sobrecalentando  reproducir&aacute; un bip repetido de tono alto mientras la computadora est&aacute;  funcionando.<br />
          <br />
          C&oacute;digo bip significado causa probable:<br />
          <br />
          1 Largo, 2 cortos = Falla en el adaptador de  video Adaptador de video fallado<br />
          Repetitivo (bucle sin fin) = Error de memoria  Memoria falla o mala conexi&oacute;n<br />
          1 Largo, 3 Cortos = Falla en el adaptador de  video Adaptador de video o memoria fallados<br />
          Bips de alta frecuencia = CPU Sobrecalentado  Falla en el ventilador del CPU<br />
          Repetidos Bips Altos y Bajos = Falla en el CPU  Falla en el procesador<br />
        </li>
        <li>Phoenix BIOS:<br />
          <br />
          Phoenix BIOS usa patrones de c&oacute;digos BIP para  indicar problemas. En la tabla siguiente el &quot;-&quot; indica una peque&ntilde;a  pausa entre bips.<br />
          <br />
          Ejemplo: 1 - 1 - 2 sonara como BIP&nbsp;&nbsp; BIP&nbsp;&nbsp;  BIP BIP<br />
          <br />
          C&Oacute;DIGO SIGNIFICADO CAUSA PROBABLE<br />
        </li>
      </ul>
    </div>
    <p align="left" class="Estilo4">1 - 1 &ndash; 2 =  CPU / motherboard failure Fallo CPU / motherboard<br />
      1 - 1 &ndash; 3 = CMOS read/write failure Fallo de  Motherboard<br />
      1 - 1 - 4 = BIOS ROM failure Fallo en la BIOS<br />
      1 - 2 &ndash; 1 = Timer failure Fallo de Motherboard<br />
      1 - 2 - 2 = DMA failure Fallo de Motherboard<br />
      1 - 2 - 3 = DMA failure Fallo de Motherboard<br />
      1 - 3 - 1 = Memory refresh failure Fallo de  memoria<br />
      1 - 3 - 2 = 64K memory failure Fallo de memoria<br />
      1 - 3 - 3 = 64K memory failure Fallo de memoria<br />
      1 - 3 - 4&nbsp;  = 64K memory failure Fallo de memoria<br />
      1 - 4 - 1 = Address line failure Fallo de  memoria<br />
      1 - 4 - 2 = Parity error Fallo de memoria<br />
      1 - 4 - 3 = Timer failure Fallo de Motherboard<br />
      1 - 4 - 4 = NMI port failure Fallo de  Motherboard<br />
      2 - 1 - 1 = 64K memory failure Fallo de memoria<br />
      3 - 1 - 1 = Slave DMA failure Fallo de  Motherboard<br />
      3 - 1 - 2 = Master DMA failure Fallo de  Motherboard<br />
      3 - 1 - 3 = Interrupt controller failure Fallo  de Motherboard<br />
      3 - 1 -4 = Slave IC failure Fallo de Motherboard<br />
      3 - 2 -2 = Interrupt Controller failure Fallo de  Motherboard<br />
      3 - 2 - 3 = RESERVADO<br />
      3 - 2 - 4 = Keyboard control failure Fallo de  Motherboard<br />
      3 - 3 - 1 = CMOS batter failure Falla la bater&iacute;a  CMOS<br />
      3 - 3 - 2 = CMOS configuration error  Configuraci&oacute;n err&oacute;nea<br />
      3 - 3 - 3 = RESERVADO<br />
      3 - 3 - 4 = Video memory failure Falla en la  tarjeta de video o memoria<br />
      3 - 4 - 1 = Video init failure Falla en la  tarjeta de video o memoria<br />
      4 - 2 - 1 = Timer failure Fallo de Motherboard<br />
      4 - 2 - 2 = CMOS shutdown failure Fallo de  Motherboard<br />
      4 - 2 - 3 = Gate A20 failure Fallo de  Motherboard<br />
      4 - 2 - 4 = Unexpected interrupt Fallo en el  procesador<br />
      4 - 3 - 1 = RAM test failure Fallo de memoria<br />
      4 - 3 - 3 = Timer failure Fallo de Motherboard<br />
      4 - 3 - 4 = RTC failure Fallo de Motherboard<br />
      4 - 4 - 1 = Serial port failure Fallo de  Motherboard<br />
      4 - 4 - 2 = Parallel port failure Fallo de  Motherboard<br />
      4 - 4 - 3 = Coprocessor failure Fallo de  Motherboard or CPU.<br />
      9 - 2 - 1 = Video adapter incompatibility Usar  otro modelo de placa de video.</p>
    <p align="left" class="Estilo4">Se realiz&oacute; una estad&iacute;stica basada en una investigaci&oacute;n de la cual se  retom&oacute; a los 3 fabricantes de la BIOS m&aacute;s reconocidos en el mercado tomando en  cuenta el n&uacute;mero de fallas que nos permiten encontrar, es decir, el n&uacute;mero de  c&oacute;digos que nos ofrecen para encontrar la causa probable del problema que  presenta nuestro ordenador dado el caso. <br />
      Se obtuvo el porcentaje del n&uacute;mero de c&oacute;digos  que ofrec&iacute;a cada una de los fabricantes anteriores tomando en cuenta como el  100% al que ofrece el mayor n&uacute;mero de c&oacute;digos el cual  fue Phoenix BIOS con 38 c&oacute;digos, para AMI BIOS fue de 11 c&oacute;digos  que equivale al 28.9% y para AWARD BIOS fue de 5 que equivale al 13.1%, esto  quiere decir, que el fabricante que nos ofrece m&aacute;s posibles causas de fallas  encontradas en el ordenador es Phoenix BIOS y consecutivamente le siguen los  otros fabricantes con un porcentaje menor.</p>
    <p align="left" class="Estilo4"><strong>PRINCIPALES FABRICANTES DEL BIOS</strong></p>
    <div align="left" class="Estilo5">
      <table border="1" cellspacing="0" cellpadding="0" align="left">
        <tr>
          <td width="356" valign="top" class="Estilo6"><br />
              <strong>FABRICANTE</strong> </td>
          <td width="356" valign="top" class="Estilo6"><p align="center"><strong>PORCENTAJE DE CODIGOS </strong></p></td>
        </tr>
        <tr>
          <td width="356" valign="top" class="Estilo6"><p>Phoenix BIOS </p></td>
          <td width="356" valign="top" class="Estilo6"><p>100% </p></td>
        </tr>
        <tr>
          <td width="356" valign="top" class="Estilo6"><p>AMI BIOS </p></td>
          <td width="356" valign="top" class="Estilo6"><p>28.9% </p></td>
        </tr>
        <tr>
          <td width="356" valign="top" class="Estilo6"><p>AWARD BIOS </p></td>
          <td width="356" valign="top" class="Estilo6"><p>13.1% </p></td>
        </tr>
      </table>
    </div>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p align="left" class="Estilo4">&nbsp;</p>
    <p>&nbsp;</p>
    <p><img src="img/Captura de pantalla (42).png" width="851" height="600" /></p>
    <p>&nbsp;</p>
    <p><img src="img/Captura de pantalla (43).png" width="567" height="656" /></p>
    <p>&nbsp;</p>
    <p class="Estilo9"><a href="video3.HTML" target="_self">VIDEO</a></p>
    <p align="left">&nbsp;</p>
  </div>
</form>
</body>
</html>
