<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>INSTALACIÓN Y CONFIGURACIÓN DE DRIVES Y SOFTWARE SEGÚN LOS REQUERIMIENTOS DEL USUARIO</title>
<style type="text/css">
<!--
.Estilo1 {font-size: 24px}
.Estilo2 {font-size: 36px}
.Estilo3 {font-size: 24px; color: #FF0000; }
-->
</style>
</head>

<body>
<form id="form1" name="form1" method="post" action="">
  <p align="center" class="Estilo3">INSTALACI&Oacute;N Y CONFIGURACI&Oacute;N DE DRIVES Y SOFTWARE  SEG&Uacute;N LOS REQUERIMIENTOS DEL USUARIO </p>
  <p align="center" class="Estilo1">&nbsp;</p>
  <p>Un&nbsp;Driver o controlador, es un programa  que controla un dispositivo. Cada dispositivo, ya sea una impresora, un  teclado, etc., debe tener un programa controlador.<br />
    Muchos  controladores, como el del teclado, vienen con el sistema operativo. Para otros  dispositivos, puedes tener que instalar el nuevo controlador cuando conectas el  dispositivo al ordenador. En Windows, los controladores normalmente tienen la  extensi&oacute;n .drv.<br />
    Un  controlador act&uacute;a como un traductor entre el dispositivo y los programas que  utilizan el dispositivo. Cada dispositivo tiene su propio sistema de comandos  especializados que solamente conoce su controlador, sin embargo, la mayor&iacute;a de  los programas tienen acceso a los dispositivos usando comandos gen&eacute;ricos. El  controlador, por lo tanto, acepta comandos gen&eacute;ricos de un programa y despu&eacute;s  los traduce a los comandos especializados para el dispositivo.<br />
    La configuraci&oacute;n del software es una  actividad de autoprotecci&oacute;n que se aplica para controlar los cambios a lo largo  del ciclo de vida del software. Sus objetivos son:<br />
    1. Identificar los cambios<br />
    2. Controlar los cambios<br />
    3.Garantizar  que los&nbsp;cambios&nbsp;se realicen adecuadamente<br />
    4.Auditar  e&nbsp;informar de&nbsp;los cambios realizados al interesado. <br />
    Diferencia entre mantenimiento de  software y gesti&oacute;n de configuraci&oacute;n del software<br />
    El mantenimiento es un conjunto de actividades  de ingenier&iacute;a del software que se producen despu&eacute;s de que se ha entregado al  cliente y est&eacute; en funcionamiento<br />
    Pasos para la instalaci&oacute;n de un driver  (impresora HP).</p>
  <p>1.-Pulsa en  la ventana el bot&oacute;n&nbsp;<strong>Usar disco</strong>.  Introduce el CD.</p>
  <p><img src="images/a.png" width="746" height="470" /></p>
  <p>&nbsp;</p>
  <p>2.-Haz clic  en&nbsp;<strong>Examinar</strong>. Se abre  un explorador de carpetas, localiza en el CD el archivo con los controladores y  dar doble clic sobre el.</p>
  <p><img src="images/b.png" width="801" height="600" /></p>
  <p>3.-Se  muestra una pregunta de si &iquest;desea permitir que el programa realice cambios en  el equipo? Dar clic en s&iacute;.</p>
  <p><img src="images/c.png" width="470" height="267" /></p>
  <p>&nbsp;</p>
  <p>4.-Nos  muestra que debemos conectarnos a internet para configurar el dispositivo dar  clic en no gracias esperar a que cargue dar clic en continuar.</p>
  <p><img src="images/d.png" width="480" height="339" /> <img src="images/d.0.png" width="433" height="343" /></p>
  <p>5.-Nos muestra la  obtenci&oacute;n del software por HP clic en siguiente.</p>
  <p><img src="images/e.png" width="585" height="368" /></p>
  <p>6.- Se muestran los  acuerdos de instalaci&oacute;n y configuraci&oacute;n. Dar clic en he revisado y acepto los  acuerdos y configuraci&oacute;n de instalaci&oacute;n clic en siguiente.</p>
  <p><img src="images/f.png" width="614" height="424" /></p>
  <p><br />
    7.- Esperar a que se  instale.</p>
  <p><img src="images/g.png" width="502" height="385" /> <img src="images/f.0.png" width="490" height="387" /></p>
  <p><br />
    8.- Muestra una  pregunta de &iquest;C&oacute;mo se va a conectar el dispositivo a su ordenador? Seleccionar  conectar m&aacute;s tarde. Clic en siguiente.</p>
  <p><img src="images/h.png" width="498" height="341" /></p>
  <p><br />
  9.- Muestra que el dispositivo se ha instalado correctamente. Clic en  finish.</p>
  <p><img src="images/i.png" width="544" height="359" /></p>
  <p><br />
    10.- Estar&aacute; listo el driver para ser utilizado.</p>
  <p><img src="images/j.png" width="530" height="363" /></p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="center" class="Estilo1"><a href="video8.HTML" target="_self" class="Estilo2">VIDEO</a></p>
  <p align="center" class="Estilo1">&nbsp;</p>
</form>
</body>
</html>
