<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>HISTORIA Y EVOLUCIÓN DE TODOS LOS SISTEMAS OPERATIVOS</title>
<link href="css/style.css" rel="stylesheet" type="text/css" />
<style type="text/css">
<!--
.Estilo1 {font-size: 36px}
-->
</style>
</head>

<body>
<form id="form1" name="form1" method="post" action="">
  <p align="left"><img src="EJEMPLO3.png" alt="LOGO" width="117" height="110" /></p>
  <p align="center"><strong>
    <label></label>
    HISTORIA  Y EVOLUCI&Oacute;N DE TODOS LOS SISTEMAS OPERATIVOS</strong> </p>
  <p align="left"><br />
    Historia  y evoluci&oacute;n de todos los sistemas operativos (S.O) creados hasta la fecha. Una  lista cronol&oacute;gica de todos aquellos S.O. que vieron la luz, uno de ellos se  qued&oacute; entre nosotros, y otros que no tuvieron lo necesario para quedarse, en  una &eacute;poca, donde todos quer&iacute;an ser el &ldquo;popular&rdquo; de los PC.<br />
    Cada  d&iacute;a que enciendes tu ordenador para trabajar, divertirte, navegar por la web,  jugar y hacer muchas otras cosas. Unos segundos despu&eacute;s de presionar el bot&oacute;n  &ldquo;power&rdquo;, un componente muy importante entra en juego: el sistema operativo.<br />
    Hoy,  el mercado est&aacute; bien segmentado, pero mucha gente todav&iacute;a usa Windows. Sin  embargo, la historia no siempre ha sido as&iacute;. Con los a&ntilde;os, varias empresas han  desarrollado sistemas para adaptarse a diferentes tipos de usuarios.<br />
    En  el inicio la computaci&oacute;n estaba sin forma y era vac&iacute;a<br />
    Los  ordenadores/computadoras gigantes que ocupaban cuartos enteros y que  necesitaban la ayuda de los seres humanos, que aparecieron aproximadamente en 1950.  En los primeros a&ntilde;os, las tareas se llevaron a cabo por t&eacute;cnicos, los cuales  dictaban lo que ser&iacute;a realizado a trav&eacute;s del hardware.<br />
    Un  empleado era contratado especialmente para activar y desactivar las llaves, la  cuales serv&iacute;an para indicar si un componente debe estar encendido o apagado.  Cuando se cerraba la llave, por ejemplo, la informaci&oacute;n corr&iacute;a por metros o  kil&oacute;metros de cables y encend&iacute;a una luz, indicando que determinada funciona  estaba desactivada.<br />
    En  aquella &eacute;poca, era com&uacute;n para una persona desarrollar programas de ordenador. A  pesar de trabajar para las tareas necesarias, estos equipos siempre necesitaban  de la intervenci&oacute;n humana y no pod&iacute;an usar rutinas programadas. La historia  cambio con el primer sistema operativo, aqu&iacute; todos una lista de todos esos S.O.  fueron creados hasta el momento.</p>
  <p align="left"><br />
    <strong>1950</strong>Los S.O. hacen una  aparici&oacute;n bastante simple, con conceptos tales como el monitor residente, el  proceso por lotes y el almacenamiento temporal.<br />
    <strong>El  GM-NAA I/O (1956):</strong> Fue creado por Robert L. Su funci&oacute;n  principal era ejecutar autom&aacute;ticamente un nuevo programa, una vez que el que se  estaba ejecutando terminaba.<br />
    <strong>CTSS  (1961):</strong> Fue desarrollado en el Centro de Computaci&oacute;n  del MIT. Fue descrito en una publicaci&oacute;n presentada en la Spring Joint Computer  Conference de 1962.<br />
    <strong>EXEC  II (1962):</strong> De tipo Procesamiento por lotes desarrollado  para la computadora UNIVAC 1107. Re&uacute;ne los trabajos comunes para ejecutarlos al  mismo tiempo, evitando las colas de espera de dos o m&aacute;s trabajos, como sucede  en el procesamiento en serie.<br />
    <strong>EXEC 8 (1964):</strong> Fue uno de los primeros S.O de multiprocesamiento con &eacute;xito comercial.  Soportaba cargas de trabajo mixto simult&aacute;neo que comprend&iacute;an procesamiento por  lotes, tiempo compartido y en tiempo real.<br />
    <strong>UNIX  (1969):</strong> Es un S.O portable, multitarea y multiusuario;  desarrollado por un grupo de empleados de los laboratorios Bell de AT&amp;T<br />
    <strong>OS/8  (1971):</strong> Era el sistema operativo m&aacute;s utilizado en el  PDP 8 minicomputadora desarrollada por Digital Equipment Corporation.<br />
    <strong>VM/CMS  (1972):</strong> Es un S.O. de m&aacute;quina virtual que se anunci&oacute;  para el p&uacute;blico en 1972 por IBM. Su entorno permite la ejecuci&oacute;n, creaci&oacute;n y  depuraci&oacute;n de aplicaciones, gesti&oacute;n de archivos de datos, en general es el  encargado de aceptar las &oacute;rdenes del usuario y convertirlas en instrucciones que el CP es capaz  de ejecutar.<br />
    <strong>CP/M  (1976):</strong> fue desarrollado por Gary Kildall para el  microprocesador Intel 8080. Se trataba del sistema operativo m&aacute;s popular entre  las computadoras personales en los a&ntilde;os 70.<br />
    <strong>Apple  DOS o APPLE II (1978):</strong> Fue un S.O. para la serie de  microordenadores de la serie Apple II. Anteriormente al lanzamiento de Apple  Dos 3.1 los usuarios tuvieron que depender de cintas de casete de audio para el  almacenamiento de datos y la recuperaci&oacute;n pero aquel m&eacute;todo era notoriamente  lento y poco fiable.<br />
    <strong>NLTSS (</strong><strong>1979):</strong> funcion&oacute;  inicialmente en un CDC 7600 ordenador, pero s&oacute;lo se ejecut&oacute; la producci&oacute;n de  alrededor de 1985 hasta 1994 en Cray computadoras, incluyendo el Cray-1,  Cray X-MP y Cray Y-MP modelos<br />
    <strong>SOS  (1980):</strong> Fue el S.O. de la computadora personal de Apple  III, desarrollado por Apple Inc.<br />
    <strong>SunOS  (1982):</strong> Se convirti&oacute; en la primera versi&oacute;n de MS-DOS. A  partir de aqu&iacute; sucedieron una serie de cambios hasta llegar a la versi&oacute;n 7.1,  versi&oacute;n 8 en Windows Milenio.<br />
    <strong>ProDos  (1983):</strong> Fue el &uacute;ltimo SO oficial que pod&iacute;a utilizarse  en todas las series de ordenadores Apple II. Se distribuy&oacute; hasta 1993<br />
    <strong>MSX-DOS  (1984):</strong> En la primera generaci&oacute;n, ni siquiera ten&iacute;an la  posibilidad de acceder a una unidad de disco, ya que el dispositivo de  almacenamiento m&aacute;s difundido por entonces era la cinta de casete.<br />
    <strong>IBM  con OS/2 (1985):</strong> Se desarroll&oacute; inicialmente de  manera conjunta entre Microsoft e IBM. Se ha mantenido desde entonces con  relativamente pocas nuevas caracter&iacute;sticas bajo el nombre ComStation.<br />
    <strong>AIX  (1986):</strong> es un SO UNIX System  V propiedad de IBM. AIX corre  en los servidores IBM Servers pSeries, utilizando procesadores de la familia  IBM POWER de 32 y 64 bits.<br />
    <strong>A/UX  (1988):</strong> Fue una implementaci&oacute;n del sistema operativo  Unix desarrollada por Apple Computer para algunas de sus computadoras  Macintosh.<br />
    <strong>NeXTSTEP  (1989):</strong> S.O. orientado a objetos, multitarea que NeXT  Computer, Inc. dise&ntilde;&oacute; para ser ejecutados en los computadores NeXT. NeXTSTEP  1.0 fue lanzado despu&eacute;s de pruebas que empezaron en 1986.<br />
    <strong>BeOS  (1990):</strong> S.O. para PC desarrollado por Be Incorporated  en 1990, orientado principalmente a proveer alto rendimiento en aplicaciones  multimedia. <br />
    <strong>MS-DOS  5.0 (1991):</strong> Incluyendo m&aacute;s caracter&iacute;sticas de  administraci&oacute;n de memoria y herramientas para soporte de macros, mejora del  int&eacute;rprete de &oacute;rdenes o shell.<br />
    <strong>Windows  3.1386BSD 0.1 (1992):</strong> William y Lynne Jolitz liberan  386BSD 0.1, que con el tiempo dar&aacute; lugar a los proyectos NetBSD,  FreeBSD y, m&aacute;s tarde,  OpenBSD.<br />
    Win<strong>dows NT (1993):</strong> Lanzado por Microsoft a  diferencia de Windows 3.0 era un SO de 32 Bits.<br />
    <strong>OpenBSD  (1995):</strong> S.O. libre tipo Unix multiplataforma, basado en  4.4 BSD. Es un descendiente de NetBSD, con un foco especial en la seguridad y la  criptograf&iacute;a<br />
    <strong>Windows  NT 4.0 (1996):</strong> Fue la cuarta versi&oacute;n del SO de  Microsoft Windows NT. Es un sistema Windows de 32-bit disponible para  estaciones de trabajo y versiones para servidores con una interfaz gr&aacute;fica  similar a la de Windows 95.<br />
    <strong>Windows 98 </strong><strong>(1998):</strong> Cuyo nombre en clave es Memphis fue un SO gr&aacute;fico publicado el 25 de junio por Microsoft y el sucesor  de Windows. <br />
    <strong>AtheOS  (2000):</strong> S.O. de c&oacute;digo abierto para plataforma Intel  x86. Al principio AtheOS pretend&iacute;a ser un clon de Amigaos.<br />
    <strong>Windows  XP (2001):</strong> Cuyo nombre en clave inicial fue Whistler es  una versi&oacute;n de Microsoft Windows, l&iacute;nea de SO desarrollado por Microsoft.<br />
    <strong>Windows  Server 2003(2003):</strong> Es un SO de la familia Windows de  la marca Microsoft para servidores. Est&aacute; basada en tecnolog&iacute;a NT y su versi&oacute;n  del n&uacute;cleo NT es la 5.2.<br />
    <strong>WINDOWS  VISTA (2006):</strong> Este S.O. una versi&oacute;n de Windows  desarrollada por Microsoft. Se enfoca para ser utilizada en equipos de  escritorio en hogares y oficinas, equipos port&aacute;tiles, tabletas y equipos media  center.<br />
    <strong>Mac OS X v10.5 (2007):</strong> Es  la sexta versi&oacute;n  del SO de Apple, Mac OS X,  para computadoras de escritorio y servidores Macintosh. Cubriendo componentes  del n&uacute;cleo del sistema operativo.<br />
    <strong>Windows  Server 2008 (2008):</strong> S.O. de Microsoft dise&ntilde;ado para  servidores. Es el sucesor de Windows Server 2003, distribuido al p&uacute;blico casi  cinco a&ntilde;os despu&eacute;s. Al igual que Windows 7.<br />
    <strong>JNode  (2009):</strong> S.O. totalmente hecho en Java, a excepci&oacute;n de  una m&iacute;nima cantidad de c&oacute;digo en assembler. Consiste en desarrollar un sistema  operativo para uso personal en el que cualquier aplicaci&oacute;n pueda correr de  manera r&aacute;pida y segura.<br />
    <strong>Windows  8 (2012):</strong> E s la versi&oacute;n actual del S.O. de Microsoft  Windows, producido por Microsoft para su uso en computadoras personales, su  acomodo de todos los datos de la computadora es diferente a los dem&aacute;s.<br />
    <strong>Windows  10 (2014):</strong> S.O. desarrollado por Microsoft como parte de  la familia de sistemas operativos Windows NT. Fue dado a conocer oficialmente  en septiembre, seguido por una breve presentaci&oacute;n de demostraci&oacute;n en la  conferencia Build.<br />
    <strong>Creators Update</strong><strong> (2017): </strong>Lanzamiento oficial  de la &uacute;ltima versi&oacute;n de Windows 10, llamada Creators Update.<br />
    <strong>REACTOS  (2018): </strong>Este sistema operativo comparte muchas cosas con  Windows y es compatible con muchas de las funciones y aplicaciones que tiene  ese S.O. No comparte toda la l&iacute;nea de c&oacute;digos de Windows.</p>
  <p align="left">&nbsp;</p>
  <p align="left">&nbsp;</p>
  <p align="left">&nbsp;</p>
  <p align="center"><strong>ESTAD&Iacute;STICA DE  EVOLUCI&Oacute;N DE LOS S.O.</strong></p>
  <p>Tomando en cuenta desde la d&eacute;cada de 1950 a 1980  de desarrollo de los S.O.&nbsp; Se realiz&oacute; una  estad&iacute;stica en la cual se muestra el n&uacute;mero de a&ntilde;os m&aacute;s repetitivo en que  tardaban en sacar al mercado un nuevo S.O, es decir la <strong>moda </strong>que es una&nbsp;<strong>medida de tendencia central</strong>&nbsp;que  indica el&nbsp;<strong>valor que m&aacute;s se repite</strong>&nbsp;en un  grupo de n&uacute;meros. En un mismo estudio<strong>&nbsp;puede haber m&aacute;s de una moda</strong>,  esto ocurre cuando dos (<strong>bimodal</strong>) o  m&aacute;s n&uacute;meros (<strong>multimodal</strong>)<em>&nbsp;</em>se repiten la misma cantidad de  veces siendo este es el m&aacute;ximo n&uacute;mero de veces del conjunto.&nbsp;Tambi&eacute;n puede  darse el caso a la inversa y que en una muestra no haya moda por la ausencia de  repetici&oacute;n de los datos, a esto se le llama muestra <strong>amodal</strong>. La moda puede ser calculada para datos agrupados la cual la  f&oacute;rmula es la siguiente&nbsp;                                                                       &nbsp;&nbsp;y para datos no  agrupados que solo es checando cual es el valor m&aacute;s repetido lo que se us&oacute; en  este caso ya que los datos mostrados a continuaci&oacute;n son datos no agrupado ya  que no se encuentran en una tabla de frecuencias: </p>
  <p align="center"><img src="img/Captura de pantalla (36).png" width="693" height="154" /></p>
  <p align="center"><br />
Los  n&uacute;meros m&aacute;s repetidos son 5 y 2 considerado como <strong>muestra Bimodal</strong> ya que los dos se repiten con la misma frecuencia.  Esto quiere decir, que el tiempo en que tardaban para sacar un nuevo S.O. era  de 2 y 5 a&ntilde;os entre cada uno respectivamente.<br />
Se  realiz&oacute; un estudio estad&iacute;stico para mostrar la moda o el n&uacute;mero de a&ntilde;os m&aacute;s frecuentes  en el que se tardaba en sacar un nuevo S.O durante las d&eacute;cadas de 1950 a 1980.<br />
<strong>D&Eacute;CADA DE 1950</strong></p>
  <p align="center"><img src="img/Captura de pantalla (37).png" width="514" height="639" /></p>
  <p>La  d&eacute;cada en la que fue m&aacute;s notorio el desarrollo de los sistemas fue a partir de  1980 ya que de acuerdo a la estad&iacute;stica casi cada a&ntilde;o se sacaba un nuevo S.O.  al mercado. Ya que en las otras d&eacute;cadas el n&uacute;mero de veces en las que se sac&oacute;  nuevos S.O. fue de 2 o 4 veces o menos mientras que en esta d&eacute;cada fue de 6  veces.</p>
  <img src="img/Captura de pantalla (34).png" width="941" height="575" align="middle" />
  <p align="center">&nbsp;</p>
  <p align="center" class="Estilo1"><a href="video1.HTML" target="_self">VIDEO</a><a href="video1.HTML" target="_blank"></a></p>
  <DIV ALING="CENTER">
<CENTER>
</CENTER>
</form>
</body>
</html>
